In [64]:
import pandas as pd
data=pd.read_csv(r"C:/Users/kbenayad/Desktop/data_challenge\bank-additional-full.csv",sep=";")
data=data[["age","job","marital","education","housing","loan"]]
data.head()

   age        job  marital    education housing loan
0   56  housemaid  married     basic.4y      no   no
1   57   services  married  high.school      no   no
2   37   services  married  high.school     yes   no
3   40     admin.  married     basic.6y      no   no
4   56   services  married  high.school      no  yes

In [65]:
data.count()

age          41188
job          41188
marital      41188
education    41188
housing      41188
loan         41188
dtype: int64

In [68]:
data1=data[0:200]
data2=data[201:400]
print(data1.count())
print(data2.count())

age          200
job          200
marital      200
education    200
housing      200
loan         200
dtype: int64
age          199
job          199
marital      199
education    199
housing      199
loan         199
dtype: int64

In [69]:
data1.to_csv(r"C:/Users/kbenayad/Desktop/data_challenge\data1.csv")
data2.to_csv(r"C:/Users/kbenayad/Desktop/data_challenge\data2.csv")

In [70]:
data1=pd.read_csv(r"C:/Users/kbenayad/Desktop/data_challenge\data1.csv",sep=",",index_col=0)
data1.head(5)

   age        job  marital    education housing loan
0   56  housemaid  married     basic.4y      no   no
1   57   services  married  high.school      no   no
2   37   services  married  high.school     yes   no
3   40     admin.  married     basic.6y      no   no
4   56   services  married  high.school      no  yes

In [71]:
data2=pd.read_csv(r"C:/Users/kbenayad/Desktop/data_challenge\data2.csv",sep=",",index_col=0)
data2.head()

     age          job  marital          education housing loan
201   32     services   single           basic.6y      no   no
202   39  blue-collar  married        high.school     yes   no
203   43       admin.  married            unknown      no   no
204   44  blue-collar  married           basic.9y     yes   no
205   35      student   single  university.degree      no   no

In [ ]:
merge=pd.concat